Repository: ARMAAdev/Dots-AI-Voice-Driven-Assistive-App
Catalog: lib/l10n/intl_*.arb
Languages: ar, bn, de, es, fr, hi, pt, ru, ur, zh

# dotslogo
source: images/dots.png
ar: images/dotsAR.png

# appTitle
source: Dots
ar: نقاط
hi: डॉट्स
ur: ڈاٹس

# item1Header
source: Welcome to dots
ar: مرحبًا بكم في دوتس
bn: Dots এ স্বাগতম
de: Willkommen bei Dots
es: Bienvenido a Dots
fr: Bienvenue chez Dots
hi: डॉट्स में आपका स्वागत है
pt: Bem-vindo ao Dots
ru: Добро пожаловать в Dots
ur: ڈاٹس میں خوش آمدید
zh: 欢迎来到Dots

# item1Description
source: Braille at Your Fingertips
ar: برايل في متناول يديك
bn: আপনার আঙুলের ডগায় ব্রেইল
de: Braille unter Ihren Fingerspitzen
es: Braille en tus dedos
fr: Le braille à portée de main
hi: आपकी उंगलियों पर ब्रेल
pt: Braille na ponta dos seus dedos
ru: Брайль под вашими кончиками пальцев
ur: آپ کی انگلیوں پر بریل
zh: 触手可及的盲文

# item2Header
source: Transcribe
ar: نسخ
bn: ট্রান্সক্রাইব
de: Transkribieren
es: Transcribir
fr: Transcrire
hi: ट्रांसक्राइब
pt: Transcrever
ru: Транскрибировать
ur: تحریر کریں
zh: 转录

# item2Description
source: Capture braille characters using your device's camera and transcribe them into plain text.
ar: التقط أحرف برايل باستخدام كاميرا جهازك وقم بنسخها إلى نص عادي.
bn: আপনার ডিভাইসের ক্যামেরা ব্যবহার করে ব্রেইল অক্ষর ক্যাপচার করুন এবং তা সাধারণ টেক্সটে ট্রান্সক্রাইব করুন।
de: Erfassen Sie Braille-Zeichen mit der Kamera Ihres Geräts und transkribieren Sie sie in normalen Text.
es: Captura caracteres braille usando la cámara de tu dispositivo y transcríbelos a texto plano.
fr: Capturez les caractères braille avec la caméra de votre appareil et transcrivez-les en texte clair.
hi: अपने डिवाइस के कैमरा का उपयोग करके ब्रेल अक्षरों को कैप्चर करें और उन्हें सादे पाठ में ट्रांसक्राइब करें।
pt: Capture caracteres em braille usando a câmera do seu dispositivo e transcreva-os para texto simples.
ru: Захватите символы Брайля с помощью камеры вашего устройства и транскрибируйте их в обычный текст.
ur: اپنے آلہ کے کیمرہ کا استعمال کرکے بریل کرداروں کو کیپچر کریں اور انہیں عام متن میں تبدیل کریں۔
zh: 使用您的设备相机捕捉盲文字符，并将其转录为普通文本。

# item3Header
source: Translate
ar: ترجمة
bn: অনুবাদ
de: Übersetzen
es: Traducir
fr: Traduire
hi: अनुवाद
pt: Traduzir
ru: Перевести
ur: ترجمہ
zh: 翻译

# item3Description
source: Translate the transcribed braille text into your preferred language for better understanding.
ar: ترجمة النص البرايل المنسوخ إلى لغتك المفضلة لفهم أفضل.
bn: আপনার পছন্দের ভাষায় ট্রান্সক্রাইব করা ব্রেইল টেক্সট অনুবাদ করুন যাতে আপনি ভালোভাবে বুঝতে পারেন।
de: Übersetzen Sie den transkribierten Braille-Text in Ihre bevorzugte Sprache für ein besseres Verständnis.
es: Traduce el texto braille transcrito a tu idioma preferido para una mejor comprensión.
fr: Traduisez le texte en braille transcrit dans votre langue préférée pour une meilleure compréhension.
hi: बेहतर समझ के लिए ट्रांसक्राइब किए गए ब्रेल टेक्स्ट को अपनी पसंदीदा भाषा में अनुवाद करें।
pt: Traduza o texto em braille transcrito para o seu idioma preferido para melhor entendimento.
ru: Переведите транскрибированный текст Брайля на ваш предпочтительный язык для лучшего понимания.
ur: بہتر سمجھ کے لئے تحریر کردہ بریل متن کو اپنی پسندیدہ زبان میں ترجمہ کریں۔
zh: 将转录的盲文文本翻译成您偏好的语言，以便更好地理解。

# item4Header
source: Read
ar: قراءة
bn: পড়ুন
de: Lesen
es: Leer
fr: Lire
hi: पढ़ें
pt: Ler
ru: Читать
ur: پڑھیں
zh: 朗读

# item4Description
source: Convert the translated text into speech and listen to it read aloud for accessibility.
ar: تحويل النص المترجم إلى كلام واستمع إليه يتم قراءته بصوت عالٍ لتسهيل الوصول.
bn: অনূদিত টেক্সটটি বক্তৃতায় রূপান্তর করুন এবং এটি উচ্চস্বরে পড়তে শুনুন।
de: Konvertieren Sie den übersetzten Text in Sprache und hören Sie ihn sich laut für die Zugänglichkeit an.
es: Convierte el texto traducido en voz y escúchalo en voz alta para accesibilidad.
fr: Convertissez le texte traduit en parole et écoutez-le à haute voix pour l'accessibilité.
hi: अनुवादित पाठ को भाषण में परिवर्तित करें और उसे एक्सेसिबिलिटी के लिए जोर से सुनें।
pt: Converta o texto traduzido em fala e ouça-o em voz alta para acessibilidade.
ru: Преобразуйте переведенный текст в речь и слушайте его вслух для доступности.
ur: ترجمہ شدہ متن کو تقریر میں تبدیل کریں اور اسے رسائی کے لئے بلند آواز میں سنیں۔
zh: 将翻译的文本转换为语音，并大声朗读以便于访问。

# item5Header
source: Listen
ar: استمع
bn: শোনা
de: Hören
es: Escuchar
fr: Écouter
hi: सुनें
pt: Ouvir
ru: Слушать
ur: سنیں
zh: 听

# item5Description
source: Enjoy the convenience of having braille content read to you in your preferred language.
ar: استمتع بميزة قراءة محتوى البرايل بصوت مسموع بلغتك المفضلة.
bn: আপনার পছন্দের ভাষায় ব্রেইল কন্টেন্ট পড়ে শোনার সুবিধা উপভোগ করুন।
de: Genießen Sie den Komfort, Braille-Inhalte in Ihrer bevorzugten Sprache vorgelesen zu bekommen.
es: Disfruta de la comodidad de tener contenido en braille leído en tu idioma preferido.
fr: Profitez de la commodité d'avoir le contenu en braille lu dans votre langue préférée.
hi: अपनी पसंदीदा भाषा में ब्रेल सामग्री को पढ़कर सुनने का आनंद लें।
pt: Aproveite a conveniência de ter conteúdo em braille lido em seu idioma preferido.
ru: Наслаждайтесь удобством прослушивания содержимого Брайля на вашем предпочтительном языке.
ur: اپنی پسندیدہ زبان میں بریل مواد کو پڑھ کر سننے کی سہولت سے لطف اٹھائیں۔
zh: 享受用您偏好的语言朗读盲文内容的便利。

source: Get Started
ar: ابدأ الآن
bn: শুরু করুন
de: Loslegen
es: Comenzar
fr: Commencer
hi: शुरू करें
pt: Começar
ru: Начать
ur: شروع کریں
zh: 开始

source: Home
ar: الصفحة الرئيسية
bn: হোম
de: Startseite
es: Inicio
fr: Accueil
hi: होम
pt: Início
ru: Главная
ur: ہوم
zh: 首页

source: History
ar: التاريخ
bn: ইতিহাস
de: Verlauf
es: Historia
fr: Historique
hi: इतिहास
pt: Histórico
ru: История
ur: تاریخ
zh: 历史记录

source: Braille Translation
ar: ترجمة برايل
bn: ব্রেইল অনুবাদ
de: Braille-Übersetzung
es: Traducción Braille
fr: Traduction Braille
hi: ब्रेल अनुवाद
pt: Tradução em Braille
ru: Перевод Брайля
ur: بریل ترجمہ
zh: 盲文翻译

source: Vision
ar: رؤية
bn: দৃষ্টি
de: Sehen
es: Visión
hi: दृष्टि
pt: Visão
ru: Зрение
ur: بینائی
zh: 视力

source: Reader
ar: قارئ
bn: রিডার
de: Lesegerät
es: Lector
fr: Lecteur
hi: रीडर
pt: Leitor
ru: Читалка
ur: ریڈر
zh: 阅读器

source: Read & Translate
ar: قراءة وترجمة

source: Settings
ar: الإعدادات
bn: সেটিংস
de: Einstellungen
es: Configuración
fr: Paramètres
hi: सेटिंग्स
pt: Configurações
ru: Настройки
ur: ترتیبات
zh: 设置

source: Speech
ar: كلام
bn: ভাষণ
de: Sprache
es: Habla
fr: Parole
hi: भाषण
pt: Fala
ru: Речь
ur: تقریر
zh: 语音

source: Braille
ar: برايل
bn: ব্রেইল
hi: ब्रेल
ru: Брайль
ur: بریل
zh: 盲文

# ArabicM
source: Arabic
ar: عربي
bn: আরবি
de: Arabisch
es: Arábica
fr: Arabe
hi: अरबी
pt: Árabe
ru: Арабский
ur: عربی
zh: 阿拉伯

source: Egyptian Arabic
ar: العربية المصرية

# EnglishM
source: English
ar: إنجليزي
bn: ইংরেজি
de: Englisch
es: Inglés
fr: Anglais
hi: अंग्रेज़ी
pt: Inglês
ru: Английский
ur: انگریزی
zh: 英语

# FrenchM
source: French
ar: فرنسي
bn: ফরাসি
de: Französisch
es: Francés
fr: Français
hi: फ़्रेंच
pt: Francês
ru: Французский
ur: فرانسیسی
zh: 法语

# MandarinChineseM
source: Mandarin Chinese
ar: الصينية الماندرين
bn: ম্যান্ডারিন চাইনিজ
es: Chino mandarín
hi: मंदारिन चीनी
pt: Chinês mandarim
ru: Китайский мандарин
ur: مینڈارن چینی
zh: 普通话

# HindiM
source: Hindi
ar: الهندية
bn: হিন্দি
hi: हिंदी
ru: Хинди
ur: ہندی
zh: 印地语

# SpanishM
source: Spanish
ar: الإسبانية
bn: স্পেনীয়
de: Spanisch
es: Español
fr: Espagnol
hi: स्पैनिश
pt: Espanhol
ru: Испанский язык
zh: 西班牙语

# BengaliM
source: Bengali
ar: البنغالية
bn: বাংলা
es: Bengalí
hi: बंगाली
ru: Бенгальский
ur: بنگالی
zh: 孟加拉

# PortugueseM
source: Portuguese
ar: البرتغالية

# RussianM
source: Russian
ar: الروسية
bn: রাশিয়ান
de: Russisch
es: Ruso
fr: Russe
hi: रूसी
pt: Russo
ru: Русский
ur: روسی
zh: 俄语

# UrduM
source: Urdu
ar: الأردية
bn: উর্দু
fr: Ourdou
hi: उर्दू
ru: Урду
ur: اردو
zh: 乌尔都语

# GermanM
source: German
ar: الألمانية
bn: জার্মান
de: Deutsch
es: Alemán
fr: Allemand
hi: जर्मन
pt: Alemão
ru: Немецкий
ur: جرمن
zh: 德语

# CameraBT
source: Camera
ar: الكاميرا
bn: ক্যামেরা
de: Kamera
es: Cámara
fr: Caméra
hi: कैमरा
pt: Câmera
ru: Камера
ur: کیمرہ
zh: 相机

# GalleryBT
source: Gallery
ar: المعرض
bn: গ্যালারি
de: Galerie
es: Galería
fr: Galerie
hi: गैलरी
pt: Galeria
ru: Галерея
ur: گیلری
zh: 画廊

source: Braille-Unicode
ar: برايل-يونيكود
bn: ব্রেইল ইউনিকোড
es: Unicode Braille
fr: Unicode Braille
hi: ब्रेल यूनिकोड
pt: Unicode Braille
ru: Unicode Braille
ur: بریل یونیکوڈ
zh: 盲文统一码

source: Translation
ar: ترجمة
bn: অনুবাদ
es: Traducción
fr: Traduction
hi: अनुवाद
pt: Tradução
ru: Tradução
ur: ترجمہ
zh: 翻译

source: Copy
ar: نسخ
bn: কপি
es: Copiar
fr: Copier
hi: कॉपी
pt: Copiar
ru: Copiar
ur: کاپی
zh: 复制

source: Share
ar: مشاركة
bn: শেয়ার
es: Compartir
fr: Partager
hi: साझा करें
pt: Compartilhar
ru: Compartilhar
ur: شیئر کریں
zh: 分享

source: Play audio
ar: تشغيل الصوت
bn: অডিও চালান
es: Reproducir audio
fr: Lire l'audio
hi: ऑडियो चलाएं
pt: Reproduzir áudio
ru: Reproduzir áudio
ur: آڈیو چلائیں
zh: 播放音频

# Textcopiedtoclipboard
source: Text copied to the clipboard
ar: تم نسخ النص إلى الحافظة
bn: টেক্সট ক্লিপবোর্ডে কপি করা হয়েছে
de: Text in die Zwischenablage kopiert
es: Texto copiado al portapapeles
fr: Texte copié dans le presse-papiers
hi: पाठ क्लिपबोर्ड में कॉपी किया गया
pt: Texto copiado para a área de transferência
ru: Текст скопирован в буфер обмена
ur: متن کلپ بورڈ میں کاپی کیا گیا
zh: 文本已复制到剪贴板

source: Extracted Text
ar: النص المستخرج
bn: প্রাপ্ত টেক্সট
de: Extrahierter Text
es: Texto extraído
hi: निकाला गया पाठ
pt: Texto extraído
ru: Извлеченный текст
ur: نکالا گیا متن
zh: 提取的文本

# SelectAppLang
source: Select App Language
ar: اختر لغة التطبيق

source: FAQ
ar: الأسئلة الشائعة

# uploadBT
source: Upload and Translate
ar: رفع وترجمة
bn: আপলোড এবং অনুবাদ করুন
de: Hochladen und Übersetzen
es: Subir y traducir
fr: Télécharger et traduire
hi: अपलोड और अनुवाद करें
pt: Carregar e traduzir
ru: Загрузить и перевести
ur: اپ لوڈ اور ترجمہ کریں
zh: 上传并翻译

# SettingsTitle
source: Settings
ar: الإعدادات

# AppLangSub
source: APP Language
ar: لغة التطبيق
bn: অ্যাপ ভাষা
de: APP-Sprache
es: Idioma de la aplicación
fr: Langue de l'application
hi: ऐप भाषा
pt: Idioma do aplicativo
ru: Язык приложения
ur: ایپ کی زبان
zh: 应用程序语言

# DefultLangBT
source: Defult Language
ar: اللغة الافتراضية
bn: ডিফল্ট ভাষা
de: Standardsprache
es: Idioma predeterminado
fr: Langue par défaut
hi: डिफ़ॉल्ट भाषा
pt: Idioma padrão
ru: Язык по умолчанию
ur: طے شدہ زبان
zh: 默认语言

# DefultModLangBT
source: Defult Module Language
ar: لغة الوحدة الافتراضية
bn: ডিফল্ট মডিউল ভাষা
de: Standardmodulsprache
es: Idioma del módulo predeterminado
fr: Langue du module par défaut
hi: डिफ़ॉल्ट मॉड्यूल भाषा
pt: Idioma do módulo padrão
ru: Язык модуля по умолчанию
ur: طے شدہ ماڈیول زبان
zh: 默认模块语言

# SpeechOutSub
source: Speech Output
ar: إخراج الصوت
bn: ভাষণ আউটপুট
de: Sprachausgabe
es: Salida de voz
fr: Sortie vocale
hi: वाणी आउटपुट
pt: Saída de voz
ru: Голосовой вывод
ur: خطاب کی آواز
zh: 语音输出

# MaleVRB
source: Male Voice
ar: صوت ذكر
bn: পুরুষ ভয়েস
de: Männliche Stimme
es: Voz masculina
fr: Voix masculine
hi: पुरुष वाणी
pt: Voz masculina
ru: Мужской голос
ur: مردانی آواز
zh: 男性语音

# FemalVRB
source: Female Voice
ar: صوت أنثى
bn: মহিলা ভয়েস
de: Weibliche Stimme
es: Voz femenina
fr: Voix féminine
hi: महिला वाणी
pt: Voz feminina
ru: Женский голос
ur: خواتین کی آواز
zh: 女性语音

# SuppSub
source: Support
ar: الدعم
bn: সহায়তা
de: Unterstützung
es: Soporte
hi: समर्थन
pt: Suporte
ru: Поддержка
ur: مدد
zh: 支持

# SendFeedBT
source: Send Feedback
ar: إرسال ملاحظات
bn: প্রতিক্রিয়া প্রেরণ করুন
de: Feedback senden
es: Enviar comentarios
fr: Envoyer des commentaires
hi: प्रतिक्रिया भेजें
pt: Enviar feedback
ru: Отправить отзыв
ur: تاثرات بھیجیں
zh: 发送反馈

# RepABugBT
source: Report A Bug
ar: الإبلاغ عن خطأ
bn: একটি বাগ প্রতিবেদনকরুন
de: Einen Fehler melden
es: Reportar un error
fr: Signaler un bug
hi: एकबगरिपोर्टकरें
pt: Relatar um bug
ru: Сообщить об ошибке
ur: ایک خرابی کی اطلاع دیں
zh: 报告错误

source: SelectVision
ar: اختر لغة الرؤية
bn: ভিশন নির্বাচন করুন
de: Vision auswählen
es: Seleccionar Visión
fr: Sélectionner Vision
hi: विजन चुनें
pt: Selecionar Visão
ru: Выбрать Видение
ur: وژن منتخب کریں
zh: 选择视力

source: SelectBraille
ar: اختر لغة برايل
bn: ব্রেইল নির্বাচন করুন
de: Braille auswählen
es: Seleccionar Braille
fr: Sélectionner Braille
hi: ब्रेल चुनें
pt: Selecionar Braille
ru: Выбрать Брайль
ur: بریل منتخب کریں
zh: 选择盲文

source: Select Reader
ar: اختر لغة القارئ
bn: রিডার নির্বাচন করুন
de: Lesegerät auswählen
es: Seleccionar Lector
fr: Sélectionner Lecteur
hi: रीडर चुनें
pt: Selecionar Leitor
ru: Выбрать Читалку
ur: ریڈر منتخب کریں
zh: 选择阅读器

# question1
source: How do I use the Vision module?
ar: كيف أستخدم وحدة الرؤية؟
bn: আমি ভিশন মডিউলটি কীভাবে ব্যবহার করব?
de: Wie benutze ich das Vision-Modul?
es: ¿Cómo utilizo el módulo Vision?
fr: Comment puis-je utiliser le module Vision?
hi: मैं विजन मॉड्यूल का उपयोग कैसे करूं?
pt: Como eu uso o módulo Vision?
ru: Как использовать модуль Vision?
ur: میں وژن ماڈیول کا استعمال کس طرح کروں؟
zh: 我如何使用Vision模块？

# answer1
source: To use the Vision module, simply tap on the Vision icon in the main menu. Point your device's camera at the object or whatever you want to analyze and the app will provide comprehensive analysis about it.
ar: لاستخدام وحدة الرؤية، اضغط ببساطة على رمز الرؤية في القائمة الرئيسية. وجه كاميرا جهازك إلى الشيء أو ما تريد تحليله وسيقدم التطبيق تحليلًا شاملاً عنه.
bn: ভিশন মডিউলটি ব্যবহার করতে, কেবল প্রধান মেনুতে ভিশন আইকনে ট্যাপ করুন। আপনার ডিভাইসের ক্যামেরাটি যে কোনও বস্তুতে নির্দেশ করুন বা যা আপনি বিশ্লেষণ করতে চান এবং অ্যাপটি এর সম্পর্কে সম্পূর্ণ বিশ্লেষণ সরবরাহ করবে।
de: Um das Vision-Modul zu verwenden, tippen Sie einfach auf das Vision-Symbol im Hauptmenü. Richten Sie die Kamera Ihres Geräts auf das Objekt oder was auch immer Sie analysieren möchten und die App wird eine umfassende Analyse darüber liefern.
es: Para utilizar el módulo Vision, simplemente toca el icono Vision en el menú principal. Apunta la cámara de tu dispositivo al objeto o lo que quieras analizar y la aplicación proporcionará un análisis completo al respecto.
fr: Pour utiliser le module Vision, il suffit de taper sur l'icône Vision dans le menu principal. Pointez la caméra de votre appareil sur l'objet ou ce que vous voulez analyser et l'application fournira une analyse complète à ce sujet.
hi: विजन मॉड्यूल का उपयोग करने के लिए, बस मुख्य मेनू में विजन आइकन पर टैप करें। अपने डिवाइस के कैमरे को उस वस्तु या जो कुछ भी आप विश्लेषण करना चाहते हैं पर इशारा करें और ऐप इसके बारे में व्यापक विश्लेषण प्रदान करेगा।
pt: Para usar o módulo Vision, basta tocar no ícone Vision no menu principal. Aponte a câmera do seu dispositivo para o objeto ou o que você deseja analisar e o aplicativo fornecerá uma análise abrangente sobre ele.
ru: Чтобы использовать модуль Vision, просто нажмите на иконку Vision в главном меню. Направьте камеру вашего устройства на объект или то, что вы хотите проанализировать, и приложение предоставит всесторонний анализ.
ur: وژن ماڈیول کا استعمال کرنے کے لئے ، صرف مین مینو میں وژن آئیکن پر ٹیپ کریں۔ اپنے ڈیوائس کا کیمرہ اس چیز یا جو کچھ بھی آپ تجزیہ کرنا چاہتے ہیں پر اشارہ کریں اور ایپ اس کے بارے میں جامع تجزیہ فراہم کرے گی۔
zh: 要使用Vision模块，只需在主菜单中点击Vision图标。将您的设备的摄像头对准您想要分析的对象或任何东西，应用程序将提供全面的分析。

# question2
source: How do I translate text to Braille?
ar: كيف أترجم النص إلى برايل؟
bn: আমি টেক্সটকে ব্রেইলে অনুবাদ করব কীভাবে?
de: Wie übersetze ich Text in Braille?
es: ¿Cómo traduzco texto a Braille?
fr: Comment puis-je traduire du texte en braille?
hi: मैं ब्रेल को टेक्स्ट में कैसे अनुवादित करूं?
pt: Como eu traduzo texto para Braille?
ru: Как перевести текст в Брайля?
ur: میں بریل کو ٹیکسٹ میں کس طرح ترجمہ کروں؟
zh: 我如何将文本翻译成盲文？

# answer2
source: To translate text to Braille, go to the Braille Translate module from the main menu. Scan the braille you want to translate, and the app will display the corresponding text translation in your desired language.
ar: لترجمة النص إلى برايل، انتقل إلى وحدة ترجمة برايل من القائمة الرئيسية. قم بمسح برايل الذي تريد ترجمته، وسيعرض التطبيق الترجمة النصية المقابلة بلغتك المفضلة.
bn: টেক্সটকে ব্রেইলে অনুবাদ করতে, প্রধান মেনু থেকে ব্রেইল অনুবাদ মডিউলে যান। আপনি যে ব্রেইলটি অনুবাদ করতে চান তা স্ক্যান করুন, এবং অ্যাপটি আপনার পছন্দের ভাষায় সম্পর্কিত টেক্সট অনুবাদ প্রদর্শন করবে।
de: Um Text in Braille zu übersetzen, gehen Sie zum Braille-Übersetzungsmodul im Hauptmenü. Scannen Sie das Braille, das Sie übersetzen möchten, und die App zeigt die entsprechende Textübersetzung in Ihrer gewünschten Sprache an.
es: Para traducir texto a Braille, ve al módulo de Traducción Braille desde el menú principal. Escanea el braille que quieres traducir, y la aplicación mostrará la traducción de texto correspondiente en tu idioma deseado.
fr: Pour traduire du texte en braille, allez au module de traduction en braille à partir du menu principal. Scannez le braille que vous voulez traduire, et l'application affichera la traduction du texte correspondant dans votre langue souhaitée.
hi: ब्रेल को टेक्स्ट में अनुवादित करने के लिए, मुख्य मेनू से ब्रेल अनुवाद मॉड्यूल पर जाएं। ब्रेल स्कैन करें जिसे आप अनुवादित करना चाहते हैं, और ऐप आपकी वांछित भाषा में संबंधित पाठ्य अनुवाद प्रदर्शित करेगा।
pt: Para traduzir texto para Braille, vá para o módulo de Tradução Braille a partir do menu principal. Digitalize o Braille que você deseja traduzir, e o aplicativo exibirá a tradução de texto correspondente no idioma desejado.
ru: Чтобы перевести текст в Брайля, перейдите в модуль перевода Брайля из главного меню. Отсканируйте Брайля, который вы хотите перевести, и приложение отобразит соответствующий текстовый перевод на выбранном вами языке.
ur: بریل کو ٹیکسٹ میں ترجمہ کرنے کے لئے ، مین مینو سے بریل ترجمہ ماڈیول پر جائیں۔ بریل سکین کریں جسے آپ ترجمہ کرنا چاہتے ہیں ، اور ایپ آپ کی خواہش کی بھاشا میں متناسب ٹیکسٹ ترجمہ دکھائے گی۔
zh: 要将文本翻译成盲文，从主菜单进入盲文翻译模块。扫描您想要翻译的盲文，应用程序将显示相应的文本翻译，以您所需的语言。

# question3
source: How can I change the app language?
ar: كيف يمكنني تغيير لغة التطبيق؟
bn: আমি অ্যাপের ভাষা পরিবর্তন করব কীভাবে?
de: Wie kann ich die Sprache der App ändern?
es: ¿Cómo puedo cambiar el idioma de la aplicación?
fr: Comment puis-je changer la langue de l'application?
hi: मैं ऐप की भाषा कैसे बदलूं?
pt: Como eu posso mudar o idioma do aplicativo?
ru: Как я могу изменить язык приложения?
ur: میں ایپ کی زبان کس طرح تبدیل کروں؟
zh: 我如何更改应用程序的语言？

# answer3
source: To change the app language, go to the Settings page and tap on the 'App Language' option. Select your preferred language from the list, and the app will update its language accordingly.
ar: لتغيير لغة التطبيق، انتقل إلى صفحة الإعدادات واضغط على خيار 'لغة التطبيق'. اختر لغتك المفضلة من القائمة وسيقوم التطبيق بتحديث لغته وفقًا لذلك.
bn: অ্যাপের ভাষা পরিবর্তন করতে, সেটিংস পৃষ্ঠায় যান এবং 'অ্যাপ ভাষা' বিকল্পটিতে ট্যাপ করুন। তালিকা থেকে আপনার পছন্দের ভাষা নির্বাচন করুন, এবং অ্যাপটি তার ভাষা সংশোধন করবে।
de: Um die Sprache der App zu ändern, gehen Sie zur Einstellungsseite und tippen Sie auf die Option 'App-Sprache'. Wählen Sie Ihre bevorzugte Sprache aus der Liste aus und die App wird ihre Sprache entsprechend aktualisieren.
es: Para cambiar el idioma de la aplicación, ve a la página de Configuración y toca la opción 'Idioma de la aplicación'. Selecciona tu idioma preferido de la lista, y la aplicación actualizará su idioma en consecuencia.
fr: Pour changer la langue de l'application, allez à la page des paramètres et appuyez sur l'option 'Langue de l'application'. Sélectionnez votre langue préférée dans la liste, et l'application mettra à jour sa langue en conséquence.
hi: ऐप की भाषा बदलने के लिए, सेटिंग्स पेज पर जाएं और 'ऐप भाषा' विकल्प पर टैप करें। सूची से अपनी पसंदीदा भाषा का चयन करें, और ऐप अपनी भाषा को उसके अनुसार अपडेट करेगा।
pt: Para mudar o idioma do aplicativo, vá para a página de Configurações e toque na opção 'Idioma do aplicativo'. Selecione o idioma preferido da lista, e o aplicativo atualizará seu idioma de acordo.
ru: Чтобы изменить язык приложения, перейдите на страницу настроек и нажмите на опцию 'Язык приложения'. Выберите предпочитаемый вами язык из списка, и приложение обновит свой язык соответственно.
ur: ایپ کی زبان تبدیل کرنے کے لئے ، سیٹنگز صفحہ پر جائیں اور 'ایپ زبان' کا اختیار ٹیپ کریں۔ فہرست سے اپنی پسندیدہ زبان کا انتخاب کریں ، اور ایپ اپنی زبان کو اس کے مطابق اپ ڈیٹ کرے گی۔
zh: 要更改应用程序的语言，转到设置页面，点击'应用程序语言'选项。从列表中选择您喜欢的语言，应用程序将相应地更新其语言。

# question4
source: Can I customize the speech output voice?
ar: هل يمكنني تخصيص صوت الإخراج؟
bn: আমি কি বক্তব্য আউটপুট ভয়েসটি কাস্টমাইজ করতে পারি?
de: Kann ich die Sprachausgabe anpassen?
es: ¿Puedo personalizar la voz de salida de voz?
fr: Puis-je personnaliser la voix de sortie vocale?
hi: क्या मैं वाणी आउटपुट वॉयस कस्टमाइज़ कर सकता हूं?
pt: Posso personalizar a voz de saída de fala?
ru: Могу ли я настроить голосовой вывод?
ur: کیا میں خطاب کی آواز کو کسٹمائز کر سکتا ہوں؟
zh: 我可以自定义语音输出声音吗？

# answer4
source: Yes, you can customize the speech output voice in the Settings page. Under the 'Speech Output' section, you can toggle between a male and female voice.
ar: نعم، يمكنك تخصيص صوت الإخراج في صفحة الإعدادات. تحت قسم 'إخراج الصوت'، يمكنك التبديل بين صوت ذكر وصوت أنثى.
bn: হ্যাঁ, আপনি সেটিংস পৃষ্ঠায় বক্তব্য আউটপুট ভয়েসটি কাস্টমাইজ করতে পারেন। 'বক্তব্য আউটপুট' বিভাগের অধীনে, আপনি একটি পুরুষ এবং মহিলা ভয়েসের মধ্যে টগল করতে পারেন।
de: Ja, Sie können die Sprachausgabe auf der Einstellungsseite anpassen. Im Abschnitt 'Sprachausgabe' können Sie zwischen einer männlichen und weiblichen Stimme wechseln.
es: Sí, puedes personalizar la voz de salida de voz en la página de Configuración. En la sección 'Salida de voz', puedes alternar entre una voz masculina y femenina.
fr: Oui, vous pouvez personnaliser la voix de sortie vocale dans la page des paramètres. Sous la section 'Sortie vocale', vous pouvez basculer entre une voix masculine et féminine.
hi: हां, आप सेटिंग्स पेज में वाणी आउटपुट वॉयस को कस्टमाइज़ कर सकते हैं। 'वाणी आउटपुट' खंड में, आप पुरुष और महिला वॉयस के बीच टॉगल कर सकते हैं।
pt: Sim, você pode personalizar a voz de saída de fala na página de Configurações. Na seção 'Saída de Fala', você pode alternar entre uma voz masculina e feminina.
ru: Да, вы можете настроить голосовой вывод на странице настроек. В разделе 'Голосовой вывод' вы можете переключаться между мужским и женским голосом.
ur: جی ہاں ، آپ سیٹنگز صفحہ میں خطاب کی آواز کو کسٹمائز کر سکتے ہیں۔ 'خطاب کی آواز' کے حصے میں ، آپ مردانہ اور خواتین کی آواز کے درمیان ٹوگل کر سکتے ہیں۔
zh: 是的，您可以在设置页面中自定义语音输出声音。在'语音输出'部分，您可以在男性和女性声音之间切换。

# question5
source: How can I provide feedback or report a bug?
ar: كيف يمكنني تقديم ملاحظات أو الإبلاغ عن خطأ؟
bn: আমি কীভাবে প্রতিক্রিয়া দিব বা একটি বাগ প্রতিবেদন করব?
de: Wie kann ich Feedback geben oder einen Fehler melden?
es: ¿Cómo puedo proporcionar comentarios o informar de un error?
fr: Comment puis-je donner mon avis ou signaler un bug?
hi: मैं प्रतिक्रिया कैसे दूं या एक बग की सूचना कैसे दूं?
pt: Como posso fornecer feedback ou relatar um bug?
ru: Как мне оставить отзыв или сообщить об ошибке?
ur: میں رائے کیسے دوں یا ایک بگ کی اطلاع کیسے دوں؟
zh: 我如何提供反馈或报告错误？
