Repository: ARMAAdev/Dots-AI-Voice-Driven-Assistive-App
Catalog: lib/l10n/intl_*.arb
Languages: ar, bn, de, es, fr, hi, pt, ru, ur, zh

# answer5
source: To provide feedback or report a bug, go to the Settings page and tap on either the 'Send Feedback' or 'Report a Bug' option. Fill in the necessary details and submit your feedback or bug report.
ar: لتقديم ملاحظات أو الإبلاغ عن خطأ، انتقل إلى صفحة الإعدادات واضغط على إما 'إرسال ملاحظات' أو 'الإبلاغ عن خطأ'. املأ التفاصيل اللازمة وأرسل ملاحظاتك أو تقرير الخطأ.
bn: প্রতিক্রিয়া দিতে বা একটি বাগ প্রতিবেদন করতে, সেটিংস পৃষ্ঠায় যান এবং 'প্রতিক্রিয়া প্রেরণ' বা 'বাগ প্রতিবেদন' বিকল্পটিতে ট্যাপ করুন। প্রয়োজনীয় বিবরণগুলি পূরণ করুন এবং আপনার প্রতিক্রিয়া বা বাগ প্রতিবেদন জমা দিন।
de: Um Feedback zu geben oder einen Fehler zu melden, gehen Sie zur Einstellungsseite und tippen Sie auf die Option 'Feedback senden' oder 'Fehler melden'. Füllen Sie die notwendigen Details aus und senden Sie Ihr Feedback oder Fehlerbericht ab.
es: Para proporcionar comentarios o informar de un error, ve a la página de Configuración y toca la opción 'Enviar comentarios' o 'Informar de un error'. Rellena los detalles necesarios y envía tus comentarios o informe de error.
fr: Pour donner votre avis ou signaler un bug, allez à la page des paramètres et appuyez sur l'option 'Envoyer un avis' ou 'Signaler un bug'. Remplissez les détails nécessaires et soumettez votre avis ou rapport de bug.
hi: प्रतिक्रिया देने या एक बग की सूचना देने के लिए, सेटिंग्स पेज पर जाएं और 'प्रतिक्रिया भेजें' या 'बग की सूचना दें' विकल्प पर टैप करें। आवश्यक विवरण भरें और अपनी प्रतिक्रिया या बग रिपोर्ट सबमिट करें।
pt: Para fornecer feedback ou relatar um bug, vá para a página de Configurações e toque na opção 'Enviar Feedback' ou 'Relatar um Bug'. Preencha os detalhes necessários e envie seu feedback ou relatório de bug.
ru: Чтобы оставить отзыв или сообщить об ошибке, перейдите на страницу настроек и нажмите на опцию 'Отправить отзыв' или 'Сообщить об ошибке'. Заполните необходимые детали и отправьте ваш отзыв или отчет об ошибке.
ur: رائے دینے یا ایک بگ کی اطلاع دینے کے لئے ، سیٹنگز صفحہ پر جائیں اور 'رائے بھیجیں' یا 'بگ کی اطلاع دیں' کا اختیار ٹیپ کریں۔ ضروری تفصیلات بھریں اور اپنی رائے یا بگ رپورٹ جمع کرائیں۔
zh: 要提供反馈或报告错误，转到设置页面，点击'发送反馈'或'报告错误'选项。填写必要的详细信息并提交您的反馈或错误报告。

# question6
source: Is my data secure when using this app?
ar: هل بياناتي آمنة عند استخدام هذا التطبيق؟
bn: এই অ্যাপ ব্যবহার করার সময় আমার ডেটা নিরাপদ কি?
de: Sind meine Daten sicher, wenn ich diese App benutze?
es: ¿Están seguros mis datos cuando utilizo esta aplicación?
fr: Mes données sont-elles sécurisées lorsque j'utilise cette application?
hi: क्या मेरा डेटा इस ऐप का उपयोग करते समय सुरक्षित है?
pt: Meus dados estão seguros ao usar este aplicativo?
ru: Безопасны ли мои данные при использовании этого приложения?
ur: کیا میرا ڈیٹا اس ایپ کا استعمال کرتے ہوئے محفوظ ہے؟
zh: 当我使用这个应用程序时，我的数据是否安全？

# answer6
source: Yes, we take data security and privacy seriously. All data processed by the app is kept strictly confidential and is not shared with any third parties.
ar: نعم، نحن نأخذ أمان البيانات والخصوصية على محمل الجد. جميع البيانات المعالجة بواسطة التطبيق تظل سرية تمامًا ولا يتم مشاركتها مع أي أطراف ثالثة.
bn: হ্যাঁ, আমরা ডেটা নিরাপত্তা এবং গোপনীয়তা গুরুত্ব দিই। অ্যাপটি দ্বারা প্রক্রিয়াজাত সমস্ত ডেটা সম্পূর্ণ গোপনীয় রাখা হয় এবং তৃতীয় পক্ষের সাথে শেয়ার করা হয় না।
de: Ja, wir nehmen Datensicherheit und Datenschutz ernst. Alle von der App verarbeiteten Daten werden streng vertraulich behandelt und nicht mit Dritten geteilt.
es: Sí, tomamos en serio la seguridad de los datos y la privacidad. Todos los datos procesados por la aplicación se mantienen estrictamente confidenciales y no se comparten con terceros.
fr: Oui, nous prenons la sécurité des données et la confidentialité au sérieux. Toutes les données traitées par l'application sont strictement confidentielles et ne sont pas partagées avec des tiers.
hi: हां, हम डेटा सुरक्षा और गोपनीयता को गंभीरता से लेते हैं। ऐप द्वारा संसाधित सभी डेटा सख्ती से गोपनीय रखा जाता है और तीसरे पक्ष के साथ साझा नहीं किया जाता है।
pt: Sim, levamos a segurança dos dados e a privacidade a sério. Todos os dados processados pelo aplicativo são mantidos estritamente confidenciais e não são compartilhados com terceiros.
ru: Да, мы серьезно относимся к безопасности данных и конфиденциальности. Все данные, обрабатываемые приложением, строго конфиденциальны и не передаются третьим лицам.
ur: جی ہاں ، ہم ڈیٹا سیکیورٹی اور پرائیویسی کو سنجیدگی سے لیتے ہیں۔ ایپ کے ذریعہ پروسیس کردہ تمام ڈیٹا سختی سے خفیہ رکھا جاتا ہے اور تیسرے طرف کے ساتھ شیئر نہیں کیا جاتا ہے۔
zh: 是的，我们非常重视数据安全和隐私。应用程序处理的所有数据都严格保密，不会与任何第三方共享。

# question7
source: Can I use this app offline?
ar: هل يمكنني استخدام هذا التطبيق دون اتصال بالإنترنت؟
bn: আমি কি এই অ্যাপটি অফলাইনে ব্যবহার করতে পারি?
de: Kann ich diese App offline nutzen?
es: ¿Puedo utilizar esta aplicación sin conexión?
fr: Puis-je utiliser cette application hors ligne?
hi: क्या मैं इस ऐप का उपयोग ऑफ़लाइन कर सकता हूं?
pt: Posso usar este aplicativo offline?
ru: Могу ли я использовать это приложение в автономном режиме?
ur: کیا میں اس ایپ کو آف لائن استعمال کر سکتا ہوں؟
zh: 我可以离线使用这个应用程序吗？

# answer7
source: All of the app"s modules, including Vision, Braille Translate, and Reader, require an active internet connection to function properly. This is because the app relies on cloud-based services to process and provide accurate results. However, you can still open the app and access your previous history while offline. This means you can view your past scans, translations, and other data without an internet connection. Keep in mind that performing new scans, translations, or accessing any features that require real-time processing will not be possible offline.
ar: جميع وحدات التطبيق، بما في ذلك الرؤية، ترجمة برايل، والقارئ، تتطلب اتصالاً نشطًا بالإنترنت لتعمل بشكل صحيح. وذلك لأن التطبيق يعتمد على الخدمات السحابية لمعالجة وتقديم نتائج دقيقة. ومع ذلك، يمكنك فتح التطبيق والوصول إلى تاريخك السابق دون اتصال بالإنترنت. هذا يعني أنه يمكنك عرض عمليات المسح السابقة، الترجمات، والبيانات الأخرى بدون اتصال. ضع في اعتبارك أن إجراء عمليات مسح جديدة، الترجمات، أو الوصول إلى أي ميزات تتطلب معالجة في الوقت الفعلي لن يكون ممكنًا دون اتصال.
bn: অ্যাপের সমস্ত মডিউল, যেমন ভিশন, ব্রেইল অনুবাদ, এবং রিডার, সঠিকভাবে কাজ করার জন্য একটি সক্রিয় ইন্টারনেট সংযোগ প্রয়োজন। এটি কারণ অ্যাপটি মেঘ ভিত্তিক সেবাগুলিতে নির্ভর করে প্রক্রিয়া এবং সঠিক ফলাফল সরবরাহ করে। তবে, আপনি এখনও অ্যাপটি খুলে অফলাইনে আপনার পূর্বের ইতিহাস অ্যাক্সেস করতে পারেন। এর অর্থ হলো আপনি ইন্টারনেট সংযোগ ছাড়াই আপনার গত স্ক্যানগুলি, অনুবাদ এবং অন্যান্য ডেটা দেখতে পারেন। মনে রাখবেন যে নতুন স্ক্যান, অনুবাদ করা বা বাস্তব সময় প্রক্রিয়াজাত কোনও বৈশিষ্ট্য অ্যাক্সেস করা অফলাইনে সম্ভব হবে না।
de: Alle Module der App, einschließlich Vision, Braille-Übersetzung und Reader, benötigen eine aktive Internetverbindung, um ordnungsgemäß zu funktionieren. Dies liegt daran, dass die App auf cloudbasierte Dienste angewiesen ist, um genaue Ergebnisse zu verarbeiten und bereitzustellen. Sie können die App jedoch weiterhin öffnen und auf Ihre vorherige Historie zugreifen, während Sie offline sind. Das bedeutet, dass Sie Ihre vergangenen Scans, Übersetzungen und andere Daten ohne Internetverbindung einsehen können. Beachten Sie jedoch, dass das Durchführen neuer Scans, Übersetzungen oder das Zugreifen auf Funktionen, die eine Echtzeitverarbeitung erfordern, offline nicht möglich ist.
es: Todos los módulos de la aplicación, incluyendo Vision, Braille Translate y Reader, requieren una conexión a Internet activa para funcionar correctamente. Esto se debe a que la aplicación depende de servicios basados en la nube para procesar y proporcionar resultados precisos. Sin embargo, todavía puedes abrir la aplicación y acceder a tu historial anterior mientras estás desconectado. Esto significa que puedes ver tus escaneos pasados, traducciones y otros datos sin una conexión a Internet. Ten en cuenta que realizar nuevos escaneos, traducciones o acceder a cualquier característica que requiera un procesamiento en tiempo real no será posible sin conexión.
fr: Tous les modules de l'application, y compris Vision, Traduction en braille et Lecteur, nécessitent une connexion Internet active pour fonctionner correctement. C'est parce que l'application s'appuie sur des services basés sur le cloud pour traiter et fournir des résultats précis. Cependant, vous pouvez toujours ouvrir l'application et accéder à votre historique précédent en mode hors ligne. Cela signifie que vous pouvez consulter vos scans passés, traductions et autres données sans connexion Internet. Gardez à l'esprit que l'exécution de nouveaux scans, traductions ou l'accès à des fonctionnalités qui nécessitent un traitement en temps réel ne sera pas possible hors ligne.
hi: ऐप के सभी मॉड्यूल, जिसमें विजन, ब्रेल ट्रांसलेट और रीडर शामिल हैं, ठीक से काम करने के लिए एक सक्रिय इंटरनेट कनेक्शन की आवश्यकता होती है। यह इसलिए है क्योंकि ऐप को सटीक और सही परिणाम प्रदान करने के लिए क्लाउड-आधारित सेवाओं पर निर्भरता होती है। हालांकि, आप ऑफ़लाइन होने पर भी ऐप को खोल सकते हैं और अपने पिछले इतिहास तक पहुंच सकते हैं। इसका मतलब है कि आप अपने पिछले स्कैन, अनुवाद और अन्य डेटा को बिना इंटरनेट कनेक्शन के देख सकते हैं। ध्यान दें कि नए स्कैन, अनुवाद करने या किसी भी विशेषताओं तक पहुंचने जो वास्तविक समय में प्रसंस्करण की आवश्यकता होती है, ऑफ़लाइन संभव नहीं होगा।
pt: Todos os módulos do aplicativo, incluindo Vision, Braille Translate e Reader, requerem uma conexão ativa à internet para funcionar corretamente. Isso ocorre porque o aplicativo depende de serviços baseados em nuvem para processar e fornecer resultados precisos. No entanto, você ainda pode abrir o aplicativo e acessar seu histórico anterior enquanto estiver offline. Isso significa que você pode visualizar suas varreduras passadas, traduções e outros dados sem uma conexão à internet. Tenha em mente que a realização de novas varreduras, traduções ou o acesso a qualquer recurso que exija processamento em tempo real não será possível offline.
ru: Все модули приложения, включая Vision, Braille Translate и Reader, требуют активного интернет-соединения для надлежащей работы. Это связано с тем, что приложение полагается на облачные сервисы для обработки и предоставления точных результатов. Однако вы все равно можете открыть приложение и получить доступ к своей предыдущей истории в автономном режиме. Это означает, что вы можете просматривать свои прошлые сканы, переводы и другие данные без подключения к интернету. Имейте в виду, что выполнение новых сканирований, переводов или доступ к любым функциям, требующим обработки в реальном времени, не будет возможным в автономном режиме.
ur: ایپ کے تمام ماڈیولز ، جن میں وژن ، بریل ٹرانسلیٹ اور ریڈر شامل ہیں ، صحیح طریقے سے کام کرنے کے لئے ایک فعال انٹرنیٹ کنکشن کی ضرورت ہوتی ہے۔ یہ اس لئے ہے کہ ایپ کو سیٹی اور درست نتائج فراہم کرنے کے لئے کلاؤڈ بیسڈ سروسز پر انحصار ہوتا ہے۔ تاہم ، آپ آف لائن ہونے کے باوجود بھی ایپ کو کھول سکتے ہیں اور اپنے پچھلے تاریخچہ تک رسائی حاصل کر سکتے ہیں۔ اس کا مطلب ہے کہ آپ اپنے گزشتہ سکینز ، ترجمے اور دیگر ڈیٹا کو بغیر انٹرنیٹ کنکشن کے دیکھ سکتے ہیں۔ دھیان دیں کہ نئے سکینز ، ترجمے کرنے یا کسی بھی خصوصیات تک رسائی حاصل کرنے جو وقتی تشکیل کی ضرورت ہوتی ہے ، آف لائن ممکن نہیں ہوگا۔
zh: 应用程序的所有模块，包括Vision、盲文翻译和阅读器，都需要活动的互联网连接才能正常工作。这是因为应用程序依赖于基于云的服务来处理和提供准确的结果。然而，您仍然可以在离线时打开应用程序并访问您以前的历史记录。这意味着您可以在没有互联网连接的情况下查看您过去的扫描、翻译和其他数据。请注意，执行新的扫描、翻译或访问任何需要实时处理的功能在离线状态下将不可能。

# question8
source: How often is the app updated with new features?
ar: كم مرة يتم تحديث التطبيق بميزات جديدة؟
bn: অ্যাপটি নতুন বৈশিষ্ট্যগুলি সহ কতবার আপডেট হয়?
de: Wie oft wird die App mit neuen Funktionen aktualisiert?
es: ¿Con qué frecuencia se actualiza la aplicación con nuevas características?
fr: À quelle fréquence l'application est-elle mise à jour avec de nouvelles fonctionnalités?
hi: ऐप को नई सुविधाओं के साथ कितनी बार अपडेट किया जाता है?
pt: Com que frequência o aplicativo é atualizado com novos recursos?
ru: Как часто приложение обновляется с новыми функциями?
ur: ایپ کو نئی خصوصیات کے ساتھ کتنی بار اپ ڈیٹ کیا جاتا ہے؟
zh: 应用程序更新新功能的频率有多高？

# answer8
source: We regularly update the app with new features and improvements based on user feedback and technological advancements. Keep an eye out for app updates to access the latest features.
ar: نقوم بتحديث التطبيق بانتظام بميزات وتحسينات جديدة بناءً على ملاحظات المستخدمين والتطورات التكنولوجية. تابع تحديثات التطبيق للوصول إلى أحدث الميزات.
bn: আমরা ব্যবহারকারী প্রতিক্রিয়া এবং প্রযুক্তিগত উন্নতির উপর ভিত্তি করে নিয়মিতভাবে অ্যাপটি নতুন বৈশিষ্ট্য এবং উন্নতি সহ আপডেট করি। সর্বশেষ বৈশিষ্ট্যগুলি অ্যাক্সেস করার জন্য অ্যাপ আপডেটগুলির জন্য চোখ রাখুন।
de: Wir aktualisieren die App regelmäßig mit neuen Funktionen und Verbesserungen basierend auf Benutzerfeedback und technologischen Fortschritten. Halten Sie Ausschau nach App-Updates, um die neuesten Funktionen zu nutzen.
es: Actualizamos regularmente la aplicación con nuevas características y mejoras basadas en los comentarios de los usuarios y los avances tecnológicos. Mantén un ojo en las actualizaciones de la aplicación para acceder a las últimas características.
fr: Nous mettons à jour régulièrement l'application avec de nouvelles fonctionnalités et améliorations basées sur les commentaires des utilisateurs et les avancées technologiques. Gardez un œil sur les mises à jour de l'application pour accéder aux dernières fonctionnalités.
hi: हम उपयोगकर्ता की प्रतिक्रिया और तकनीकी प्रगति के आधार पर ऐप को नई सुविधाओं और सुधारों के साथ नियमित रूप से अपडेट करते हैं। ऐप की नवीनतम सुविधाओं तक पहुंचने के लिए ऐप के अपडेट की जांच करें।
pt: Atualizamos regularmente o aplicativo com novos recursos e melhorias com base no feedback do usuário e avanços tecnológicos. Fique de olho nas atualizações do aplicativo para acessar os recursos mais recentes.
ru: Мы регулярно обновляем приложение с новыми функциями и улучшениями на основе отзывов пользователей и технологических достижений. Следите за обновлениями приложения, чтобы получить доступ к последним функциям.
ur: ہم صارفین کی رائے اور ٹیکنالوجیکی ترقیوں کی بنیاد پر ایپ کو نئی خصوصیات اور بہتریوں کے ساتھ بار بار اپ ڈیٹ کرتے ہیں۔ ایپ کی تازہ ترین خصوصیات تک رسائی حاصل کرنے کے لئے ایپ کی تازہ ترین اپ ڈیٹس کا خیال رکھیں۔
zh: 我们根据用户反馈和技术进步定期更新应用程序的新功能和改进。请关注应用程序更新，以获取最新的功能。

# question9
source: Is the app available in multiple languages?
ar: هل التطبيق متاح بلغات متعددة؟
bn: অ্যাপটি কি একাধিক ভাষায় উপলব্ধ?
de: Ist die App in mehreren Sprachen verfügbar?
es: ¿Está disponible la aplicación en varios idiomas?
fr: L'application est-elle disponible en plusieurs langues?
hi: क्या ऐप कई भाषाओं में उपलब्ध है?
pt: O aplicativo está disponível em vários idiomas?
ru: Доступно ли приложение на нескольких языках?
ur: کیا ایپ متعدد زبانوں میں دستیاب ہے؟
zh: 应用程序是否支持多种语言？

# answer9
source: Yes, the app supports multiple languages. You can change the app language in the Settings page to your preferred language.
ar: نعم، يدعم التطبيق لغات متعددة. يمكنك تغيير لغة التطبيق في صفحة الإعدادات إلى لغتك المفضلة.
bn: হ্যাঁ, অ্যাপটি একাধিক ভাষা সমর্থন করে। আপনি সেটিংস পৃষ্ঠায় অ্যাপ ভাষা পরিবর্তন করতে পারেন আপনার পছন্দের ভাষায়।
de: Ja, die App unterstützt mehrere Sprachen. Sie können die Sprache der App auf der Einstellungsseite auf Ihre bevorzugte Sprache ändern.
es: Sí, la aplicación admite varios idiomas. Puedes cambiar el idioma de la aplicación en la página de Configuración a tu idioma preferido.
fr: Oui, l'application prend en charge plusieurs langues. Vous pouvez changer la langue de l'application dans la page des paramètres à votre langue préférée.
hi: हां, ऐप कई भाषाओं का समर्थन करता है। आप सेटिंग्स पेज पर जाकर ऐप की भाषा को अपनी पसंदीदा भाषा में बदल सकते हैं।
pt: Sim, o aplicativo suporta vários idiomas. Você pode alterar o idioma do aplicativo na página de Configurações para o seu idioma preferido.
ru: Да, приложение поддерживает несколько языков. Вы можете изменить язык приложения на странице настроек на ваш предпочитаемый язык.
ur: جی ہاں ، ایپ متعدد زبانوں کو سپورٹ کرتی ہے۔ آپ سیٹنگز کے صفحے میں جا کر ایپ کی زبان کو اپنی پسندیدہ زبان میں تبدیل کر سکتے ہیں۔
zh: 是的，应用程序支持多种语言。您可以在设置页面中将应用程序的语言更改为您喜欢的语言。

# question10
source: How can I contact support if I need further assistance?
ar: كيف يمكنني الاتصال بالدعم إذا كنت بحاجة إلى مزيد من المساعدة؟
bn: আমি যদি আরও সহায়তা প্রয়োজন হয় তবে আমি কীভাবে সহায়তা যোগাযোগ করব?
de: Wie kann ich den Support kontaktieren, wenn ich weitere Hilfe benötige?
es: ¿Cómo puedo contactar con el soporte si necesito más ayuda?
fr: Comment puis-je contacter le support si j'ai besoin d'une assistance supplémentaire?
hi: अगर मुझे और मदद की जरूरत हो तो मैं सहायता से कैसे संपर्क करूं?
pt: Como posso entrar em contato com o suporte se precisar de mais ajuda?
ru: Как мне связаться со службой поддержки, если мне нужна дополнительная помощь?
ur: اگر مجھے مزید مدد کی ضرورت ہو تو میں سپورٹ سے کیسے رابطہ کروں؟
zh: 如果我需要进一步的帮助，我应该如何联系支持？

# answer10
source: If you need further assistance or have any question's, you can contact our support team by sending an email to dotsapp@gmail.com, We'll be happy to help you!
ar: إذا كنت بحاجة إلى مزيد من المساعدة أو لديك أي أسئلة، يمكنك الاتصال بفريق الدعم الخاص بنا عن طريق إرسال بريد إلكتروني إلى dotsapp@gmail.com، سنكون سعداء بمساعدتك!
bn: আপনার যদি অতিরিক্ত সহায়তা প্রয়োজন হয় বা কোনও প্রশ্ন থাকে, তবে আপনি আমাদের সাপোর্ট দলের সাথে যোগাযোগ করতে পারেন একটি ইমেল প্রেরণ করে dotsapp@gmail.com ঠিকানায়। আমরা আপনাকে সহায়তা করতে খুশি হব।
de: Wenn Sie weitere Hilfe benötigen oder Fragen haben, können Sie unser Support-Team kontaktieren, indem Sie eine E-Mail an dotsapp@gmail.com senden. Wir helfen Ihnen gerne weiter!
es: Si necesitas más ayuda o tienes alguna pregunta, puedes contactar con nuestro equipo de soporte enviando un correo electrónico a dotsapp@gmail.com, ¡Estaremos encantados de ayudarte!
fr: Si vous avez besoin d'une assistance supplémentaire ou avez des questions, vous pouvez contacter notre équipe de support en envoyant un e-mail à dotsapp@gmail.com, Nous serons ravis de vous aider!
hi: यदि आपको अधिक सहायता की आवश्यकता है या आपके पास कोई प्रश्न है, तो आप हमारी सहायता टीम से संपर्क कर सकते हैं, dotsapp@gmail.com पर ईमेल भेजकर, हम आपकी सहायता करने में खुशी महसूस करेंगे!
pt: Se você precisar de mais ajuda ou tiver alguma dúvida, você pode entrar em contato com nossa equipe de suporte enviando um e-mail para dotsapp@gmail.com, ficaremos felizes em ajudá-lo!
ru: Если вам нужна дополнительная помощь или у вас есть вопросы, вы можете связаться с нашей службой поддержки, отправив электронное письмо на dotsapp@gmail.com, мы будем рады помочь вам!
ur: اگر آپ کو مزید مدد کی ضرورت ہو یا آپ کے پاس کوئی سوال ہو تو ، آپ ہماری سپورٹ ٹیم سے رابطہ کر سکتے ہیں ، dotsapp@gmail.com پر ای میل بھیج کر ، ہم آپ کی مدد کرنے میں خوشی محسوس کریں گے!
zh: 如果您需要进一步的帮助或有任何问题，您可以通过发送电子邮件到dotsapp@gmail.com来联系我们的支持团队，我们很乐意帮助您！
